import { ScrollView, StyleSheet, Text } from "react-native";

const ServiceTerms = () => {
  const ServiceTermsText = `

제 1 조 (목적)

이 약관은 [회사명](이하 '회사'라 합니다)이 제공하는 [서비스명] 서비스(이하 '서비스'라 합니다)의 이용조건 및 절차, 이용자와 회사의 권리, 의무 및 책임사항, 기타 필요한 사항을 규정함을 목적으로 합니다.


제 2 조 (정의)

'서비스'라 함은 회사가 제공하는 모든 온라인 서비스를 의미합니다.
'이용자'라 함은 본 약관에 따라 회사가 제공하는 서비스를 받는 회원 및 비회원을 말합니다.
'회원'이라 함은 회사와 서비스 이용 계약을 체결하고 회원 ID를 부여받은 자를 의미합니다.
'비회원'이라 함은 회원에 가입하지 않고 회사가 제공하는 서비스를 이용하는 자를 의미합니다.


제 3 조 (약관의 효력 및 변경)

본 약관은 서비스 화면에 게시하거나 기타의 방법으로 이용자에게 공지함으로써 효력을 발생합니다.
회사는 필요한 경우 관련 법령을 위배하지 않는 범위 내에서 본 약관을 변경할 수 있습니다. 변경된 약관은 적용 일자 및 개정 사유를 명시하여 현행 약관과 함께 서비스 초기 화면에 그 적용 일자 7일 전부터 적용 일자 전일까지 공지합니다.
이용자는 변경된 약관에 동의하지 않을 권리가 있으며, 변경된 약관에 동의하지 않을 경우 서비스 이용을 중단하고 회원 탈퇴를 할 수 있습니다.


제 4 조 (이용계약의 체결)

이용계약은 이용자의 약관 동의와 이용신청에 대하여 회사가 승낙함으로써 성립합니다.
회사는 다음 각 호에 해당하는 이용신청에 대하여는 승낙을 하지 않을 수 있습니다.
실명이 아니거나 타인의 명의를 이용한 경우
허위의 정보를 기재하거나, 회사가 제시하는 내용을 기재하지 않은 경우
사회의 안녕질서 또는 미풍양속을 저해할 목적으로 신청한 경우
기타 회사가 정한 이용신청 요건이 미비한 경우


제 5 조 (서비스의 이용)

서비스 이용은 회사의 업무상 또는 기술상 특별한 지장이 없는 한 연중무휴, 1일 24시간 운영을 원칙으로 합니다.
회사는 시스템 정기점검, 보수, 교체 및 고장, 통신 두절 등의 사유가 발생한 경우에는 서비스의 제공을 일시적으로 중단할 수 있습니다. 이 경우 회사는 사전 또는 사후에 이를 공지합니다.


제 6 조 (서비스 이용의 제한 및 중지)

회사는 이용자가 본 약관의 의무를 위반하거나 서비스의 정상적인 운영을 방해한 경우, 사전 통지 없이 서비스 이용을 제한하거나 중지할 수 있습니다.
장기간 휴면 회원의 경우, 일정 기간 이후 이용 자격을 상실할 수 있으며, 이 경우 회사는 사전에 통지합니다.


제 7 조 (이용자의 의무)

이용자는 다음 행위를 하여서는 안 됩니다.
신청 또는 변경 시 허위 내용의 등록
타인의 정보 도용
회사가 게시한 정보의 변경
회사가 정한 정보 이외의 정보(컴퓨터 프로그램 등) 등의 송신 또는 게시
회사와 기타 제3자의 저작권 등 지적재산권에 대한 침해
회사 및 기타 제3자의 명예를 손상시키거나 업무를 방해하는 행위
외설 또는 폭력적인 메시지, 화상, 음성, 기타 공서양속에 반하는 정보를 서비스에 공개 또는 게시하는 행위
기타 불법적이거나 부당한 행위


제 8 조 (회사의 의무)

회사는 관련 법령과 본 약관이 금지하거나 공서양속에 반하는 행위를 하지 않으며, 계속적이고 안정적으로 서비스를 제공하기 위하여 최선을 다하여야 합니다.
회사는 이용자가 안전하게 서비스를 이용할 수 있도록 개인정보 보호를 위한 보안 시스템을 갖추어야 합니다.
회사는 서비스 제공과 관련하여 알고 있는 이용자의 개인정보를 본인의 승낙 없이 제3자에게 누설, 배포하지 않으며, 이를 보호하기 위해 노력합니다.


제 9 조 (저작권의 귀속 및 이용제한)

회사가 작성한 저작물에 대한 저작권 및 기타 지적재산권은 회사에 귀속합니다.
이용자는 서비스를 이용함으로써 얻은 정보 중 회사에 지적재산권이 귀속된 정보를 회사의 사전 승낙 없이 복제, 송신, 출판, 배포, 방송 기타 방법에 의하여 영리목적으로 이용하거나 제3자에게 이용하게 하여서는 안 됩니다.


제 10 조 (분쟁 해결)

회사는 이용자가 제기하는 정당한 의견이나 불만을 반영하고 그 피해를 보상 처리하기 위하여 피해보상처리기구를 설치, 운영합니다.
회사는 이용자로부터 제출되는 불만사항 및 의견을 신속하게 처리합니다. 다만, 신속한 처리가 곤란한 경우에는 이용자에게 그 사유와 처리 일정을 즉시 통보합니다.
본 약관에 명시되지 않은 사항은 관계법령 및 상관례에 따릅니다.
  `;
  return (
    <ScrollView contentContainerStyle={styles.container}>
      <Text style={styles.title}>[서비스 이용 약관]</Text>
      <Text style={styles.text}>{ServiceTermsText}</Text>
    </ScrollView>
  );
};

const styles = StyleSheet.create({
  container: {
    padding: 20,
  },
  text: {
    fontSize: 16,
    lineHeight: 24,
  },
  title:{
    fontWeight: "bold",
    fontSize: 30,
  },
});

export default ServiceTerms;
